 မြန်မာနိုင်ငံတွင် ဝက်ဘ်အက်ပလီကေးရှင်းဖန်တီးခြင်းလုပ်ငန်းများသည် စီးပွားရေးလုပ်ငန်းများအတွက် ဝက်ဘ်ဆိုက်များ အွန်လိုင်းစျေးဝယ်ခြင်းစနစ်များ လေ့လာရေးစနစ်များ စသည်တို့ကို ဖန်တီးပေးနေပါသည်။ ဥပမာအားဖြင့် Webtech Myanmar သည် ဝက်ဘ်ဒီဇိုင်းနှင့် ဖွံ့ဖြိုးတိုးတက်မှု၊ မိုဘိုင်းအက်ပလီကေးရှင်းဖွံ့ဖြိုးတိုးတက်မှုအီး ကွန်မားရေးစနစ်များ လေ့လာရေးစနစ်များ စသည်တို့ကို ဝန်ဆောင်မှုပေးနေပါသည် 
 သတင်းအချက်အလက်နည်းပညာ၏ အဓိပ္ပာယ်
သတင်းအချက်အလက်နည်းပညာသည် ကွန်ပျူတာ၊ ဆော့ဖ်ဝဲ၊ အင်တာနက်၊ ဆက်သွယ်ရေးကိရိယာများကို အသုံးပြု၍ သတင်းအချက်အလက်များကို သိမ်းဆည်းခြင်း၊ ရယူခြင်း၊ ပို့ဆောင်ခြင်းနှင့် ပြုပြင်ပြောင်းလဲခြင်းတို့ကို ဆောင်ရွက်ခြင်းဖြစ်သည်
သတင်းအချက်အလက်နည်းပညာ၏ အစိတ်အပိုင်းများ
ကွန်ပျူတာ 
သတင်းအချက်အလက်များကို သိမ်းဆည်းခြင်း၊ ရယူခြင်းနှင့် ပြုပြင်ပြောင်းလဲခြင်းတို့ကို ဆောင်ရွက်သော စက်ကိရိယာများဖြစ်သည်။
ဆော့ဖ်ဝဲ 
ကွန်ပျူတာများကို လုပ်ဆောင်ရန် လိုအပ်သော အစီအစဉ်များဖြစ်သည်။
အင်တာနက် 
ကွန်ပျူတာများကို တစ်နေရာမှ တစ်နေရာသို့ ဆက်သွယ်ရန် အသုံးပြုသော ကွန်ပျူတာကွန်ယက်ဖြစ်သည်။
ဆက်သွယ်ရေးကိရိယာများ
သတင်းအချက်အလက်များကို ပို့ဆောင်ရန် အသုံးပြုသော ကိရိယာများဖြစ်သည်။
မြန်မာနိုင်ငံတွင် သတင်းအချက်အလက်နည်းပညာ
မြန်မာနိုင်ငံတွင် သတင်းအချက်အလက်နည်းပညာသည် ပညာရေး၊ စီးပွားရေးနှင့် လူမှုဖွံ့ဖြိုးတိုးတက်မှုတို့တွင် အရေးပါသော အခန်းကဏ္ဍတစ်ခုဖြစ်လာပါသည်။ ဥပမာအားဖြင့် Yatanarpon Cyber City သည် မြန်မာနိုင်ငံ၏ အကြီးဆုံး စင်တာဖြစ်ပြီး၊ နည်းပညာစီးပွားရေးဖွံ့ဖြိုးတိုးတက်မှုအတွက် အထောက်အကူပြုနေပါသည်။
ပညာရေးနှင့် သင်ကြားရေး
မြန်မာသတင်းအချက်အလက်နည်းပညာတက္ကသိုလ် သည် ကွန်ပျူတာသိပ္ပံနှင့် အင်ဂျင်နီယာနည်းပညာများကို သင်ကြားပေးသော တက္ကသိုလ်တစ်ခုဖြစ်ပါသည်။
နည်းပညာစင်တာများနှင့် စီမံကိန်းများ ရန်ကုန်မြို့တွင် တည်ရှိသော ဤနည်းပညာစင်တာသည် စတားတပ်များအတွက် လေ့ကျင့်ရေး၊ အရင်းအနှီးထောက်ပံ့မှုများကို ပံ့ပိုးပေးနေပါသည်။
သတင်းအချက်အလက်နည်းပညာ သည် လူမှု၊ စီးပွားရေးနှင့် ပညာရေးဆိုင်ရာ ဖွံ့ဖြိုးတိုးတက်မှုများအတွက် အရေးပါသော အခန်းကဏ္ဍတစ်ခု ဖြစ်လာပါသည်။ သတင်းအချက်အလက်နည်းပညာ၏ အသုံးပြုမှုများသည် နိုင်ငံတော်၏ တိုးတက်မှုနှင့် တိုက်ရိုက်ဆက်စပ်ပါသည်။
သတင်းအချက်အလက်နည်းပညာ၏ အကျိုးကျေးဇူးများ
ပညာရေး အရည်အသွေး မြှင့်တင်ခြင်း
သတင်းအချက်အလက်နည်းပညာကို အသုံးပြု၍ ပညာရေးဆိုင်ရာ အရည်အသွေးကို မြှင့်တင်နိုင်ပါသည်။ ဥပမာအားဖြင့်၊ တက်ဘလက်ကွန်ပျူတာများကို အသုံးပြု၍ ကျောင်းသားများအတွက် ပိုမိုလွယ်ကူသော ပညာသင်ကြားမှုများ ပေးနိုင်ပါသည်
စီးပွားရေး ဖွံ့ဖြိုးတိုးတက်မှု
သတင်းအချက်အလက်နည်းပညာကို အသုံးပြု၍ စီးပွားရေးလုပ်ငန်းများ၏ လုပ်ငန်းစဉ်များကို လွယ်ကူစွာ စီမံခန့်ခွဲနိုင်ပြီး၊ အချိန်နှင့် ကုန်ကျစရိတ်များကို လျှော့ချနိုင်ပါသည်။
ကျန်းမာရေး ဝန်ဆောင်မှုများ တိုးတက်ခြင်း
သတင်းအချက်အလက်နည်းပညာကို အသုံးပြု၍ ကျန်းမာရေးဝန်ဆောင်မှုများကို မြန်မာနိုင်ငံ၏ ရှေးရှေးကျေးလက်ဒေသများတွင်လည်း ပေးဆောင်နိုင်ပြီး၊ လူနာများ၏ ကျန်းမာရေးအခြေအနေများကို တိကျစွာ စောင့်ကြည့်နိုင်ပါသည်။
အကျိုးကျေးဇူးများ၏ အကျဉ်းချုပ်
ပညာရေး: သတင်းအချက်အလက်နည်းပညာကို အသုံးပြု၍ ပညာရေးဆိုင်ရာ အရည်အသွေးကို မြှင့်တင်နိုင်ပါသည်။
စီးပွားရေး: လုပ်ငန်းစဉ်များကို လွယ်ကူစွာ စီမံခန့်ခွဲနိုင်ပြီး၊ အချိန်နှင့် ကုန်ကျစရိတ်များကို လျှော့ချနိုင်ပါသည်။
ကျန်းမာရေး: ကျန်းမာရေးဝန်ဆောင်မှုများကို မြန်မာနိုင်ငံ၏ ရှေးရှေးကျေးလက်ဒေသများတွင်လည်း ပေးဆောင်နိုင်ပါသည်။
သတင်းအချက်အလက်နည်းပညာကို အသုံးပြုခြင်းဖြင့် မြန်မာနိုင်ငံ၏ လူမှု၊ စီးပွားရေးနှင့် ပညာရေးဆိုင်ရာ ဖွံ့ဖြိုးတိုးတက်မှုများကို မြှင့်တင်နိုင်ပါသည်။
သတင်းအချက်အလက်နည်းပညာ၏ အခြေခံ အစိတ်အပိုင်းများ
စင်တာပရိုဆက်ဆာယူနစ် စီပီယူစီပီယူ
စင်တာပရိုဆက်ဆာယူနစ် သည် ကွန်ပျူတာ၏ ဦးနှောက်အဖြစ် လုပ်ဆောင်သည်။ ၎င်းသည် အချက်အလက်များကို လက်ခံ၍ လုပ်ဆောင်ပြီး အဖြေများကို ထုတ်ပေးသည်။ စီပီယူစီပီယူ ၏ လုပ်ဆောင်နိုင်စွမ်းသည် ကွန်ပျူတာ၏ အမြန်နှုန်းနှင့် တိုက်ရိုက်ဆက်စပ်ပါသည်။
ရန်ဒမ်အက်ဆက် 
သည် ကွန်ပျူတာ၏ အချိန်ပိုင်းမှတ်ဉာဏ်အဖြစ် လုပ်ဆောင်သည်။ ၎င်းသည် လက်ရှိတွင် အသုံးပြုနေသော အချက်အလက်များကို သိမ်းဆည်းထားပြီး စီပီယူစီပီယူ သို့ အမြန်စွာ လွှဲပြောင်းပေးသည်။
သိုလှောင်မှုကိရိယာများ 
သိုလှောင်မှုကိရိယာများသည် အချက်အလက်များကို အမြဲတမ်း သိမ်းဆည်းရန် အသုံးပြုသည်။
မော်သားဘုတ် 
မော်သားဘုတ် သည် ကွန်ပျူတာ၏ အဓိကလမ်းကြောင်းဖြစ်ပြီး နှင့် အခြားကိရိယာများကို ချိတ်ဆက်ပေးသည်။ ၎င်းသည် ကွန်ပျူတာ၏ အခြေခံဖွဲ့စည်းပုံကို ဖော်ဆောင်ပေးသည်။
အားပေးကိရိယာ သည် ကွန်ပျူတာ၏ အားလျှပ်စစ်အားကို ပေးဆောင်ပေးပြီး၊ အခြားကိရိယာများကို လိုအပ်သလို လျှပ်စစ်အားဖြင့် ထောက်ပံ့ပေးသည်။
ကွန်ပျူတာကွန်ရက်  ဆိုတာဘာလဲ?
ကွန်ပျူတာကွန်ရက်သည် ကွန်ပျူတာများနှင့် အခြားကိရိယာများကို ချိတ်ဆက်၍ အချက်အလက်များကို မျှဝေခြင်းနှင့် ဆက်သွယ်ရေးလုပ်ငန်းများကို လုပ်ဆောင်ရန် အသုံးပြုသော စနစ်တစ်ခု ဖြစ်ပါသည်။ ဤကွန်ရက်များတွင် ကွန်ပျူတာများ၊ ဆာဗာများ၊ မော်တာဘုတ်များနှင့် အခြားကိရိယာများ ပါဝင်ပြီး၊ အချက်အလက်များကို အပြန်အလှန် လွှဲပြောင်းပေးသည်။ 
ကွန်ပျူတာကွန်ရက်များသည် အင်တာနက်နှင့် အခြားဆက်သွယ်ရေးဝန်ဆောင်မှုများအတွက် အခြေခံအဆင့်တစ်ခုအဖြစ် လုပ်ဆောင်နေပါသည်။
ကွန်ပျူတာရက်အမျိုးအစားများ
တည်နေရာကွန်ရက် 
သည် တစ်ခုတည်းသော အဆောက်အအုံတစ်ခုအတွင်းရှိ ကွန်ပျူတာများကို ချိတ်ဆက်၍ အချက်အလက်များကို မျှဝေခြင်းနှင့် ပရင်တာများ၊ ဖိုင်များ စသည့် အရင်းအမြစ်များကို အသုံးပြုနိုင်ရန် အသုံးပြုသည်။
ကျယ်ပြန့်နေရာကွန်ရက် 
သည် မြို့တော်များ၊ ပြည်နယ်များ သို့မဟုတ် နိုင်ငံများအတွင်းရှိ ကွန်ပျူတာကွန်ရက်များကို ချိတ်ဆက်၍ အချက်အလက်များကို အကန့်အသတ်မရှိ လွှဲပြောင်းပေးသည်။ အင်တာနက်သည် အကြီးဆုံး WAN ၏ ဥပမာတစ်ခုဖြစ်ပါသည်။
မြို့နယ်ကွန်ရက် 
သည် တစ်မြို့တစ်မြို့အတွင်းရှိ ကွန်ပျူတာကွန်ရက်များကို ချိတ်ဆက်၍ အချက်အလက်များကို မျှဝေခြင်းနှင့် ဆက်သွယ်ရေးလုပ်ငန်းများကို လုပ်ဆောင်ရန် အသုံးပြုသည်
ပုဂ္ဂိုလ်ရေးကွန်ရက်
သည် တစ်ဦးတည်းသော ပုဂ္ဂိုလ်၏ ကွန်ပျူတာများနှင့် အခြားကိရိယာများကို ချိတ်ဆက်၍ အချက်အလက်များကို မျှဝေခြင်းနှင့် ဆက်သွယ်ရေးလုပ်ငန်းများကို လုပ်ဆောင်ရန် အသုံးပြုသည်။ Bluetooth သည် PAN ၏ ဥပမာတစ်ခုဖြစ်ပါသည်။
ကွန်ပျူတာကွန်ရက်၏ အစိတ်အပိုင်းများ
ကွန်ပျူတာများ ကွန်ရက်အတွင်းရှိ ကွန်ပျူတာများသည် အချက်အလက်များကို လက်ခံ၍ လုပ်ဆောင်ပြီး အဖြေများကို ထုတ်ပေးသည်။
ဆာဗာများ ဆာဗာများသည် ကွန်ပျူတာကွန်ရက်အတွင်းရှိ အချက်အလက်များကို သိမ်းဆည်းထားပြီး၊ လိုအပ်သောအခါ ကွန်ပျူတာများကို အချက်အလက်များကို ပေးပို့ပေးသည်
မော်တာဘုတ်များ မော်တာဘုတ်များသည် ကွန်ပျူတာကွန်ရက်များအကြား အချက်အလက်များကို လွှဲပြောင်းပေးသည့် ကိရိယာများဖြစ်သည်။
စွမ်းအားပေးကိရိယာများ များသည် ကွန်ပျူတာကွန်ရက်အတွင်းရှိ ကိရိယာများကို လျှပ်စစ်အားဖြင့် ထောက်ပံ့ပေးသည်။
ကွန်ပျူတာကွန်ရက်၏ အကျိုးကျေးဇူးများ
အချက်အလက်များကို မျှဝေခြင်း: ကွန်ပျူတာကွန်ရက်များသည် ကွန်ပျူတာများအကြား အချက်အလက်များကို လွယ်ကူစွာ မျှဝေခြင်းအားဖြင့် အချိန်နှင့် ကုန်ကျစရိတ်များကို လျှော့ချနိုင်ပါသည်။
ဆက်သွယ်ရေးလုပ်ငန်းများကို လွယ်ကူစွာ လုပ်ဆောင်နိုင်ခြင်း: ကွန်ပျူတာကွန်ရက်များသည် အင်တာနက်၊ အီးမေးလ် စသည့် ဆက်သွယ်ရေးနည်းလမ်းများကို အသုံးပြု၍ ဆက်သွယ်ရေးလုပ်ငန်းများကို လွယ်ကူစွာ လုပ်ဆောင်နိုင်ပါသည်။
အရင်းအမြစ်များကို မျှဝေခြင်း: ကွန်ပျူတာကွန်ရက်များသည် ပရင်တာများ၊ ဖိုင်များ စသည့် အရင်းအမြစ်များကို မျှဝေခြင်းအားဖြင့် ကုန်ကျစရိတ်များ
သတင်းအချက်အလက်နည်းပညာ ၏ အရေးပါသော အစိတ်အပိုင်းများဖြစ်သော ကွန်ပျူတာကွန်ရက်လုံခြုံရေး  နှင့် ဒေတာဘေ့စ်စီမံခန့်ခွဲမှု ၏ အဓိကလုပ်ဆောင်ချက်များနှင့် အရေးပါမှုများကို မြန်မာဘာသာဖြင့် ရှင်းလင်းဖော်ပြပါသည်။
ကွန်ပျူတာကွန်ရက်လုံခြုံရေး 
ကွန်ပျူတာကွန်ရက်လုံခြုံရေးသည် ကွန်ပျူတာစနစ်များ၊ ကွန်ရက်များနှင့် ဒေတာများကို မလိုလားအပ်သော ဝင်ရောက်မှုများ၊ ထိခိုက်မှုများ၊ ဖျက်ဆီးမှုများနှင့် ခိုးယူမှုများမှ ကာကွယ်ရန် လုပ်ဆောင်သော နည်းလမ်းများကို ဆိုလိုပါသည်။ ၎င်း၏ အဓိကလုပ်ဆောင်ချက်များမှာ 
လုံခြုံရေးမူဝါဒများ ဖွဲ့စည်းခြင်း: အဖွဲ့အစည်း၏ လုံခြုံရေးမူဝါဒများကို ဖွဲ့စည်း၍ အချက်အလက်များကို ကာကွယ်ရန် လိုအပ်သော လမ်းညွှန်ချက်များကို သတ်မှတ်သည်။
လုံခြုံရေးစနစ်များ တပ်ဆင်ခြင်း များ စသည့် လုံခြုံရေးစနစ်များကို တပ်ဆင်၍ ကွန်ပျူတာစနစ်များကို ကာကွယ်သည်။
ဒေတာအရည်အသွေးနှင့် လုံခြုံရေး စစ်ဆေးခြင်း: ဒေတာများ၏ အရည်အသွေးနှင့် လုံခြုံရေးကို စစ်ဆေး၍ အန္တရာယ်များကို ရှာဖွေပြီး ကာကွယ်ဆောင်ရွက်သည်။
လုံခြုံရေးလေ့ကျင့်မှုများ ပြုလုပ်ခြင်း: အဖွဲ့အစည်း၏ ဝန်ထမ်းများကို လုံခြုံရေးဆိုင်ရာ လေ့ကျင့်မှုများ ပြုလုပ်၍ လုံခြုံရေးအတတ်ပညာများကို မြှင့်တင်သည်။
ဒေတာဘေ့စ်စီမံခန့်ခွဲမှု
ဒေတာဘေ့စ်စီမံခန့်ခွဲမှုသည် အချက်အလက်များကို စုဆောင်း၍ သိမ်းဆည်းခြင်း၊ အုပ်ချုပ်ခြင်းနှင့် လိုအပ်သောအခါ အသုံးပြုနိုင်ရန် စီမံခန့်ခွဲခြင်းကို ဆိုလိုပါသည်။ ၎င်း၏ အဓိကလုပ်ဆောင်ချက်များမှာ 
ဒေတာဘေ့စ်ဖွဲ့စည်းခြင်း: အဖွဲ့အစည်း၏ လိုအပ်ချက်များအရ ဒေတာဘေ့စ်ဖွဲ့စည်း၍ အချက်အလက်များကို စနစ်တကျ သိမ်းဆည်းသည်။
ဒေတာဘေ့စ်စီမံခန့်ခွဲမှု: ဒေတာဘေ့စ်၏ လုပ်ဆောင်ချက်များကို စီမံခန့်ခွဲ၍ အချက်အလက်များကို အချိန်မီ ရယူနိုင်ရန် သေချာစေသည်။
ဒေတာဘေ့စ်လုံခြုံရေး: ဒေတာဘေ့စ်များကို မလိုလားအပ်သော ဝင်ရောက်မှုများမှ ကာကွယ်ရန် လုံခြုံရေးစနစ်များကို တပ်ဆင်သည်။
ဒေတာဘေ့စ်အရည်အသွေးစစ်ဆေးခြင်း ဒေတာဘေ့စ်၏ အရည်အသွေးကို စစ်ဆေး၍ အချက်အလက်များ၏ တိကျမှုနှင့် ယုံကြည်စိတ်ချရမှုကို ထိန်းသိမ်းသည်။

